// pages/more/funny/funnyShow.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    NList:[
      {
      id:1,
      newsContent:"备战的日日夜夜仿佛还在眼前，曾遇见过你坚守在书桌旁的背影；也曾听到过你为了梦想而奋斗的朗朗读书声；考研路上，那些名为“坚持”的日子，一定被你久久铭记。明日考研，祝所有学子都能成功上岸，青春有你，唯有一起奋斗；执笔为剑，披荆斩棘；以梦为马，不负韶华。希望所有的考研人都能如愿以偿，给自己交一份满意的答卷。只愿你保持一如既往的坚定，我们会始终陪伴与祝福着你。无论这一年里，你经历了多少挣扎和痛苦，请相信，你不是一个人在奋斗！希望每一个努力的人都能考上自己理想的大学，你们都是我们心中的英雄，在这一年中，你所做的所有努力、承受的所有痛苦、熬过的每一个挣扎的黑夜，吹过的风，淋过的雨，都是为你自己。趁青春，不如就拼一次吧！春夏秋冬时光漫漫 晨昏破晓分分秒秒，也许你已疲惫不堪，也许你有些困顿茫然，但还请一定咬牙坚持！如果世上真有奇迹，那一定是努力的另一个名字。最后1天，给341万考研人加油！也许你已疲惫不堪，也许你有些困顿茫然，但还请一定咬牙坚持！如果世上真有奇迹，那一定是努力的另一个名字。最后1天，给341万考研人加油！考研这一路有苦有甜，愿你们盖上笔盖时，都有武士收刀入鞘的骄傲！",
      },
      {
      id:2,
      newsContent:"",
        },
        {
          id:3,
          newsContent:"",
            }
    ],
    newsTitle:"青春有你，唯有一起奋斗！",
    newsTime:"2021/5/5"
   
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})