// pages/indexNav/books/searchShow.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    NList:[
      {
      id:1,
      newsContent:"六年来学校发生了翻天覆地的变化，取得了有目共睹的成绩：成功更名“湖南工商大学”，成功纳入湖南省本科第一批次招生；获批湖南省博士学位授予立项建设单位，被我省推荐参加教育部新增博士学位授予单位评审；陈晓红教授先后当选中国工程院院士、第八届国家自然科学基金委全委会委员，担任国务院学位委员会管理科学与工程学科评议组召集人等职务；创新创业教育成为学校靓丽新名片，荣获多项国家级荣誉，名列全省前茅；作为唯一完成单位申报的教学成果荣获国家二等奖，实现学校该奖项零的突破。同时，获省级教学成果一等奖4项；陈晓红院士牵头获批的国家基础科学中心，实现了我省国家基础科学中心零的突破；荣获教育部人文社科优秀成果一、二、三等奖，是我省首个实现该奖项获奖“大满贯”的高校；北津学院成为我省第一所成功转设的独立学院；精致、精美、智慧、两型的校园基本建成。建筑面积6.3万㎡的经管综合楼成为了新地标；党建工作扎实开展，思想政治工作不断强化，涌现出“全国党建工作样板支部”等一批先进典型。其中，最具标志性的、最振奋人心的、最影响深远的便是，“三升”战略目标出色完成，我校办学层次实现历史性跨越。",
      },
      {
      id:2,
      newsContent:"",
        },
        {
          id:3,
          newsContent:"",
            }
    ],
    newsTitle:"喜迎党代会之请回答：2015-2021|升升升，飕飕飕！",
    newsTime:"2021/5/15"
   
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})